<?php
  //--------------------------------------ฟังชังแปลงวันเป็นภาษาไทยแบบเต็ม------------------------------------------------//
  function Thai_date($date)
  {
    list($year,$month,$day) = explode('-',$date);
	if($day <10){
	   $day = substr($day,1,1);
	}
	
    $thMonth = array("มกราคม","กุมภาพันธ์","มีนาคม","เมษายน","พฤษภาคม","มิถุนายน",     
	                            "กรกฎาคม","สิงหาคม","กันยายน","ตุลาคม","พฤศจิกายน","ธันวาคม");
	if($month<10){
	   $month = substr($month,1,1);
	}

    $year +=543;
    
    $thaidate = "วันที่ ".$day."&nbsp;".$thMonth[$month-1]." พ.ศ."."&nbsp;".$year;
	return $thaidate;  
 }
 //---------------------------------ฟังชังแปลงวันเป็นภาษาไทยแบบเต็ม-----------------------------------------------------//
?>